outf.txt
/usr/bin/java  -classpath /users/cc4351/YCSB/conf:/users/cc4351/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/users/cc4351/YCSB/rocksdb/target/rocksdb-binding-0.18.0-SNAPSHOT.jar:/users/cc4351/YCSB/rocksdb/target/dependency/HdrHistogram-2.1.4.jar:/users/cc4351/YCSB/rocksdb/target/dependency/animal-sniffer-annotations-1.19.jar:/users/cc4351/YCSB/rocksdb/target/dependency/annotations-4.1.1.4.jar:/users/cc4351/YCSB/rocksdb/target/dependency/checker-compat-qual-2.5.5.jar:/users/cc4351/YCSB/rocksdb/target/dependency/error_prone_annotations-2.4.0.jar:/users/cc4351/YCSB/rocksdb/target/dependency/failureaccess-1.0.1.jar:/users/cc4351/YCSB/rocksdb/target/dependency/grpc-api-1.36.0.jar:/users/cc4351/YCSB/rocksdb/target/dependency/grpc-context-1.36.0.jar:/users/cc4351/YCSB/rocksdb/target/dependency/grpc-core-1.36.0.jar:/users/cc4351/YCSB/rocksdb/target/dependency/grpc-netty-shaded-1.36.0.jar:/users/cc4351/YCSB/rocksdb/target/dependency/grpc-protobuf-1.36.0.jar:/users/cc4351/YCSB/rocksdb/target/dependency/grpc-protobuf-lite-1.36.0.jar:/users/cc4351/YCSB/rocksdb/target/dependency/grpc-stub-1.36.0.jar:/users/cc4351/YCSB/rocksdb/target/dependency/gson-2.8.6.jar:/users/cc4351/YCSB/rocksdb/target/dependency/guava-30.0-android.jar:/users/cc4351/YCSB/rocksdb/target/dependency/htrace-core4-4.1.0-incubating.jar:/users/cc4351/YCSB/rocksdb/target/dependency/j2objc-annotations-1.3.jar:/users/cc4351/YCSB/rocksdb/target/dependency/jcip-annotations-1.0.jar:/users/cc4351/YCSB/rocksdb/target/dependency/jsr305-3.0.2.jar:/users/cc4351/YCSB/rocksdb/target/dependency/listenablefuture-9999.0-empty-to-avoid-conflict-with-guava.jar:/users/cc4351/YCSB/rocksdb/target/dependency/perfmark-api-0.23.0.jar:/users/cc4351/YCSB/rocksdb/target/dependency/proto-google-common-protos-2.0.1.jar:/users/cc4351/YCSB/rocksdb/target/dependency/protobuf-java-3.12.0.jar:/users/cc4351/YCSB/rocksdb/target/dependency/rocksdbjni-6.2.2.jar:/users/cc4351/YCSB/rocksdb/target/dependency/slf4j-api-1.7.25.jar:/users/cc4351/YCSB/rocksdb/target/dependency/slf4j-simple-1.7.25.jar site.ycsb.Client -t -db site.ycsb.db.rocksdb.RocksDBClient -s -P workloads/workloadf -p rocksdb.dir=/tmp/ycsb-rocksdb-data -threads 1
thread count: 800
intervalns: 20000000 opcount: 1000000 minibatch: 100
expected sleep sum 9980000000
latchcount: 10000
dur of thread creation: 10944895112
dur of sleep: 10085277721
ckpt0
ckpt1
ckpt2
dur of wait thread: 137142224337
measurementInterval: 0
[OVERALL], RunTime(ms), 148264
[OVERALL], Throughput(ops/sec), 6744.725624561593
[TOTAL_GCS_G1_Young_Generation], Count, 92
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 614
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.4141261533480818
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 92
[TOTAL_GC_TIME], Time(ms), 614
[TOTAL_GC_TIME_%], Time(%), 0.4141261533480818
[READ], Operations, 0
[READ], AverageLatency(us), NaN
[READ], MinLatency(us), 9223372036854775807
[READ], MaxLatency(us), 0
[READ], 95thPercentileLatency(us), 0
[READ], 99thPercentileLatency(us), 0
[READ], Return=NOT_FOUND, 1000000
[UPDATE-FAILED], Operations, 500526
[UPDATE-FAILED], AverageLatency(us), 45297.31817527961
[UPDATE-FAILED], MinLatency(us), 1024
[UPDATE-FAILED], MaxLatency(us), 105983
[UPDATE-FAILED], 95thPercentileLatency(us), 48799
[UPDATE-FAILED], 99thPercentileLatency(us), 52127
[READ-MODIFY-WRITE], Operations, 500526
[READ-MODIFY-WRITE], AverageLatency(us), 135469.72488941633
[READ-MODIFY-WRITE], MinLatency(us), 42208
[READ-MODIFY-WRITE], MaxLatency(us), 216319
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 142719
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 147583
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 6446.0
[CLEANUP], MinLatency(us), 6444
[CLEANUP], MaxLatency(us), 6447
[CLEANUP], 95thPercentileLatency(us), 6447
[CLEANUP], 99thPercentileLatency(us), 6447
[READ-FAILED], Operations, 1000000
[READ-FAILED], AverageLatency(us), 90162.253001
[READ-FAILED], MinLatency(us), 713
[READ-FAILED], MaxLatency(us), 181503
[READ-FAILED], 95thPercentileLatency(us), 96063
[READ-FAILED], 99thPercentileLatency(us), 99775
[UPDATE], Operations, 0
[UPDATE], AverageLatency(us), NaN
[UPDATE], MinLatency(us), 9223372036854775807
[UPDATE], MaxLatency(us), 0
[UPDATE], 95thPercentileLatency(us), 0
[UPDATE], 99thPercentileLatency(us), 0
[UPDATE], Return=NOT_FOUND, 500526